analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32665/Include/spixfc_regs.h
#define MXC_F_SPIXFC_CONFIG_HI_CLK_POS                 8 /**< CONFIG_HI_CLK Position */
#define MXC_F_SPIXFC_CONFIG_HI_CLK                     ((uint32_t)(0xFUL << MXC_F_SPIXFC_CONFIG_HI_CLK_POS)) /**< CONFIG_HI_CLK Mask */
#define MXC_V_SPIXFC_CONFIG_HI_CLK_16_SCLK             ((uint32_t)0x0UL) /**< CONFIG_HI_CLK_16_SCLK Value */
#define MXC_S_SPIXFC_CONFIG_HI_CLK_16_SCLK             (MXC_V_SPIXFC_CONFIG_HI_CLK_16_SCLK << MXC_F_SPIXFC_CONFIG_HI_CLK_POS) /**< CONFIG_HI_CLK_16_SCLK Setting */

#define MXC_F_SPIXFC_CONFIG_LO_CLK_POS                 12 /**< CONFIG_LO_CLK Position */
#define MXC_F_SPIXFC_CONFIG_LO_CLK                     ((uint32_t)(0xFUL << MXC_F_SPIXFC_CONFIG_LO_CLK_POS)) /**< CONFIG_LO_CLK Mask */
#define MXC_V_SPIXFC_CONFIG_LO_CLK_16_SCLK             ((uint32_t)0x0UL) /**< CONFIG_LO_CLK_16_SCLK Value */
#define MXC_S_SPIXFC_CONFIG_LO_CLK_16_SCLK             (MXC_V_SPIXFC_CONFIG_LO_CLK_16_SCLK << MXC_F_SPIXFC_CONFIG_LO_CLK_POS) /**< CONFIG_LO_CLK_16_SCLK Setting */

#define MXC_F_SPIXFC_CONFIG_SS_ACT_POS                 16 /**< CONFIG_SS_ACT Position */
#define MXC_F_SPIXFC_CONFIG_SS_ACT                     ((uint32_t)(0x3UL << MXC_F_SPIXFC_CONFIG_SS_ACT_POS)) /**< CONFIG_SS_ACT Mask */
#define MXC_V_SPIXFC_CONFIG_SS_ACT_0_CLKS              ((uint32_t)0x0UL) /**< CONFIG_SS_ACT_0_CLKS Value */
#define MXC_S_SPIXFC_CONFIG_SS_ACT_0_CLKS              (MXC_V_SPIXFC_CONFIG_SS_ACT_0_CLKS << MXC_F_SPIXFC_CONFIG_SS_ACT_POS) /**< CONFIG_SS_ACT_0_CLKS Setting */
#define MXC_V_SPIXFC_CONFIG_SS_ACT_2_CLKS              ((uint32_t)0x1UL) /**< CONFIG_SS_ACT_2_CLKS Value */
#define MXC_S_SPIXFC_CONFIG_SS_ACT_2_CLKS              (MXC_V_SPIXFC_CONFIG_SS_ACT_2_CLKS << MXC_F_SPIXFC_CONFIG_SS_ACT_POS) /**< CONFIG_SS_ACT_2_CLKS Setting */
#define MXC_V_SPIXFC_CONFIG_SS_ACT_4_CLKS              ((uint32_t)0x2UL) /**< CONFIG_SS_ACT_4_CLKS Value */
#define MXC_S_SPIXFC_CONFIG_SS_ACT_4_CLKS              (MXC_V_SPIXFC_CONFIG_SS_ACT_4_CLKS << MXC_F_SPIXFC_CONFIG_SS_ACT_POS) /**< CONFIG_SS_ACT_4_CLKS Setting */
#define MXC_V_SPIXFC_CONFIG_SS_ACT_8_CLKS              ((uint32_t)0x3UL) /**< CONFIG_SS_ACT_8_CLKS Value */
#define MXC_S_SPIXFC_CONFIG_SS_ACT_8_CLKS              (MXC_V_SPIXFC_CONFIG_SS_ACT_8_CLKS << MXC_F_SPIXFC_CONFIG_SS_ACT_POS) /**< CONFIG_SS_ACT_8_CLKS Setting */

#define MXC_F_SPIXFC_CONFIG_SS_INACT_POS               18 /**< CONFIG_SS_INACT Position */
#define MXC_F_SPIXFC_CONFIG_SS_INACT                   ((uint32_t)(0x3UL << MXC_F_SPIXFC_CONFIG_SS_INACT_POS)) /**< CONFIG_SS_INACT Mask */
#define MXC_V_SPIXFC_CONFIG_SS_INACT_4_CLKS            ((uint32_t)0x0UL) /**< CONFIG_SS_INACT_4_CLKS Value */
#define MXC_S_SPIXFC_CONFIG_SS_INACT_4_CLKS            (MXC_V_SPIXFC_CONFIG_SS_INACT_4_CLKS << MXC_F_SPIXFC_CONFIG_SS_INACT_POS) /**< CONFIG_SS_INACT_4_CLKS Setting */
#define MXC_V_SPIXFC_CONFIG_SS_INACT_6_CLKS            ((uint32_t)0x1UL) /**< CONFIG_SS_INACT_6_CLKS Value */
#define MXC_S_SPIXFC_CONFIG_SS_INACT_6_CLKS            (MXC_V_SPIXFC_CONFIG_SS_INACT_6_CLKS << MXC_F_SPIXFC_CONFIG_SS_INACT_POS) /**< CONFIG_SS_INACT_6_CLKS Setting */
#define MXC_V_SPIXFC_CONFIG_SS_INACT_8_CLKS            ((uint32_t)0x2UL) /**< CONFIG_SS_INACT_8_CLKS Value */
#define MXC_S_SPIXFC_CONFIG_SS_INACT_8_CLKS            (MXC_V_SPIXFC_CONFIG_SS_INACT_8_CLKS << MXC_F_SPIXFC_CONFIG_SS_INACT_POS) /**< CONFIG_SS_INACT_8_CLKS Setting */
#define MXC_V_SPIXFC_CONFIG_SS_INACT_12_CLKS           ((uint32_t)0x3UL) /**< CONFIG_SS_INACT_12_CLKS Value */
#define MXC_S_SPIXFC_CONFIG_SS_INACT_12_CLKS           (MXC_V_SPIXFC_CONFIG_SS_INACT_12_CLKS << MXC_F_SPIXFC_CONFIG_SS_INACT_POS) /**< CONFIG_SS_INACT_12_CLKS Setting */

#define MXC_F_SPIXFC_CONFIG_IOSMPL_POS                 20 /**< CONFIG_IOSMPL Position */
#define MXC_F_SPIXFC_CONFIG_IOSMPL                     ((uint32_t)(0xFUL << MXC_F_SPIXFC_CONFIG_IOSMPL_POS)) /**< CONFIG_IOSMPL Mask */

/**@} end of group SPIXFC_CONFIG_Register */

/**
 * @ingroup  spixfc_registers
 * @defgroup SPIXFC_SS_POL SPIXFC_SS_POL
 * @brief    SPIX Controller Slave Select Polarity Register.
 * @{
 */
#define MXC_F_SPIXFC_SS_POL_SSPOL_0_POS                0 /**< SS_POL_SSPOL_0 Position */
#define MXC_F_SPIXFC_SS_POL_SSPOL_0                    ((uint32_t)(0x1UL << MXC_F_SPIXFC_SS_POL_SSPOL_0_POS)) /**< SS_POL_SSPOL_0 Mask */

/**@} end of group SPIXFC_SS_POL_Register */

/**
 * @ingroup  spixfc_registers
 * @defgroup SPIXFC_GEN_CTRL SPIXFC_GEN_CTRL
 * @brief    SPIX Controller General Controller Register.
 * @{
 */
#define MXC_F_SPIXFC_GEN_CTRL_ENABLE_POS               0 /**< GEN_CTRL_ENABLE Position */
#define MXC_F_SPIXFC_GEN_CTRL_ENABLE                   ((uint32_t)(0x1UL << MXC_F_SPIXFC_GEN_CTRL_ENABLE_POS)) /**< GEN_CTRL_ENABLE Mask */

#define MXC_F_SPIXFC_GEN_CTRL_TX_FIFO_EN_POS           1 /**< GEN_CTRL_TX_FIFO_EN Position */
#define MXC_F_SPIXFC_GEN_CTRL_TX_FIFO_EN               ((uint32_t)(0x1UL << MXC_F_SPIXFC_GEN_CTRL_TX_FIFO_EN_POS)) /**< GEN_CTRL_TX_FIFO_EN Mask */

#define MXC_F_SPIXFC_GEN_CTRL_RX_FIFO_EN_POS           2 /**< GEN_CTRL_RX_FIFO_EN Position */
#define MXC_F_SPIXFC_GEN_CTRL_RX_FIFO_EN               ((uint32_t)(0x1UL << MXC_F_SPIXFC_GEN_CTRL_RX_FIFO_EN_POS)) /**< GEN_CTRL_RX_FIFO_EN Mask */

#define MXC_F_SPIXFC_GEN_CTRL_BBMODE_POS               3 /**< GEN_CTRL_BBMODE Position */
#define MXC_F_SPIXFC_GEN_CTRL_BBMODE                   ((uint32_t)(0x1UL << MXC_F_SPIXFC_GEN_CTRL_BBMODE_POS)) /**< GEN_CTRL_BBMODE Mask */

#define MXC_F_SPIXFC_GEN_CTRL_SSDR_POS                 4 /**< GEN_CTRL_SSDR Position */
#define MXC_F_SPIXFC_GEN_CTRL_SSDR                     ((uint32_t)(0x1UL << MXC_F_SPIXFC_GEN_CTRL_SSDR_POS)) /**< GEN_CTRL_SSDR Mask */

#define MXC_F_SPIXFC_GEN_CTRL_SCLK_DR_POS              6 /**< GEN_CTRL_SCLK_DR Position */
#define MXC_F_SPIXFC_GEN_CTRL_SCLK_DR                  ((uint32_t)(0x1UL << MXC_F_SPIXFC_GEN_CTRL_SCLK_DR_POS)) /**< GEN_CTRL_SCLK_DR Mask */

#define MXC_F_SPIXFC_GEN_CTRL_SDIO_DATA_IN_POS         8 /**< GEN_CTRL_SDIO_DATA_IN Position */
#define MXC_F_SPIXFC_GEN_CTRL_SDIO_DATA_IN             ((uint32_t)(0xFUL << MXC_F_SPIXFC_GEN_CTRL_SDIO_DATA_IN_POS)) /**< GEN_CTRL_SDIO_DATA_IN Mask */
#define MXC_V_SPIXFC_GEN_CTRL_SDIO_DATA_IN_SDIO0       ((uint32_t)0x0UL) /**< GEN_CTRL_SDIO_DATA_IN_SDIO0 Value */
#define MXC_S_SPIXFC_GEN_CTRL_SDIO_DATA_IN_SDIO0       (MXC_V_SPIXFC_GEN_CTRL_SDIO_DATA_IN_SDIO0 << MXC_F_SPIXFC_GEN_CTRL_SDIO_DATA_IN_POS) /**< GEN_CTRL_SDIO_DATA_IN_SDIO0 Setting */
#define MXC_V_SPIXFC_GEN_CTRL_SDIO_DATA_IN_SDIO1       ((uint32_t)0x1UL) /**< GEN_CTRL_SDIO_DATA_IN_SDIO1 Value */
#define MXC_S_SPIXFC_GEN_CTRL_SDIO_DATA_IN_SDIO1       (MXC_V_SPIXFC_GEN_CTRL_SDIO_DATA_IN_SDIO1 << MXC_F_SPIXFC_GEN_CTRL_SDIO_DATA_IN_POS) /**< GEN_CTRL_SDIO_DATA_IN_SDIO1 Setting */
#define MXC_V_SPIXFC_GEN_CTRL_SDIO_DATA_IN_SDIO2       ((uint32_t)0x2UL) /**< GEN_CTRL_SDIO_DATA_IN_SDIO2 Value */
#define MXC_S_SPIXFC_GEN_CTRL_SDIO_DATA_IN_SDIO2       (MXC_V_SPIXFC_GEN_CTRL_SDIO_DATA_IN_SDIO2 << MXC_F_SPIXFC_GEN_CTRL_SDIO_DATA_IN_POS) /**< GEN_CTRL_SDIO_DATA_IN_SDIO2 Setting */
#define MXC_V_SPIXFC_GEN_CTRL_SDIO_DATA_IN_SDIO3       ((uint32_t)0x3UL) /**< GEN_CTRL_SDIO_DATA_IN_SDIO3 Value */
#define MXC_S_SPIXFC_GEN_CTRL_SDIO_DATA_IN_SDIO3       (MXC_V_SPIXFC_GEN_CTRL_SDIO_DATA_IN_SDIO3 << MXC_F_SPIXFC_GEN_CTRL_SDIO_DATA_IN_POS) /**< GEN_CTRL_SDIO_DATA_IN_SDIO3 Setting */

#define MXC_F_SPIXFC_GEN_CTRL_BB_DATA_POS              12 /**< GEN_CTRL_BB_DATA Position */
#define MXC_F_SPIXFC_GEN_CTRL_BB_DATA                  ((uint32_t)(0xFUL << MXC_F_SPIXFC_GEN_CTRL_BB_DATA_POS)) /**< GEN_CTRL_BB_DATA Mask */
#define MXC_V_SPIXFC_GEN_CTRL_BB_DATA_SDIO0            ((uint32_t)0x0UL) /**< GEN_CTRL_BB_DATA_SDIO0 Value */
#define MXC_S_SPIXFC_GEN_CTRL_BB_DATA_SDIO0            (MXC_V_SPIXFC_GEN_CTRL_BB_DATA_SDIO0 << MXC_F_SPIXFC_GEN_CTRL_BB_DATA_POS) /**< GEN_CTRL_BB_DATA_SDIO0 Setting */
#define MXC_V_SPIXFC_GEN_CTRL_BB_DATA_SDIO1            ((uint32_t)0x1UL) /**< GEN_CTRL_BB_DATA_SDIO1 Value */
#define MXC_S_SPIXFC_GEN_CTRL_BB_DATA_SDIO1            (MXC_V_SPIXFC_GEN_CTRL_BB_DATA_SDIO1 << MXC_F_SPIXFC_GEN_CTRL_BB_DATA_POS) /**< GEN_CTRL_BB_DATA_SDIO1 Setting */
#define MXC_V_SPIXFC_GEN_CTRL_BB_DATA_SDIO2            ((uint32_t)0x2UL) /**< GEN_CTRL_BB_DATA_SDIO2 Value */
#define MXC_S_SPIXFC_GEN_CTRL_BB_DATA_SDIO2            (MXC_V_SPIXFC_GEN_CTRL_BB_DATA_SDIO2 << MXC_F_SPIXFC_GEN_CTRL_BB_DATA_POS) /**< GEN_CTRL_BB_DATA_SDIO2 Setting */
#define MXC_V_SPIXFC_GEN_CTRL_BB_DATA_SDIO3            ((uint32_t)0x3UL) /**< GEN_CTRL_BB_DATA_SDIO3 Value */
#define MXC_S_SPIXFC_GEN_CTRL_BB_DATA_SDIO3            (MXC_V_SPIXFC_GEN_CTRL_BB_DATA_SDIO3 << MXC_F_SPIXFC_GEN_CTRL_BB_DATA_POS) /**< GEN_CTRL_BB_DATA_SDIO3 Setting */

#define MXC_F_SPIXFC_GEN_CTRL_BB_DATA_OUT_EN_POS       16 /**< GEN_CTRL_BB_DATA_OUT_EN Position */
#define MXC_F_SPIXFC_GEN_CTRL_BB_DATA_OUT_EN           ((uint32_t)(0xFUL << MXC_F_SPIXFC_GEN_CTRL_BB_DATA_OUT_EN_POS)) /**< GEN_CTRL_BB_DATA_OUT_EN Mask */
#define MXC_V_SPIXFC_GEN_CTRL_BB_DATA_OUT_EN_SDIO0     ((uint32_t)0x0UL) /**< GEN_CTRL_BB_DATA_OUT_EN_SDIO0 Value */
#define MXC_S_SPIXFC_GEN_CTRL_BB_DATA_OUT_EN_SDIO0     (MXC_V_SPIXFC_GEN_CTRL_BB_DATA_OUT_EN_SDIO0 << MXC_F_SPIXFC_GEN_CTRL_BB_DATA_OUT_EN_POS) /**< GEN_CTRL_BB_DATA_OUT_EN_SDIO0 Setting */
#define MXC_V_SPIXFC_GEN_CTRL_BB_DATA_OUT_EN_SDIO1     ((uint32_t)0x1UL) /**< GEN_CTRL_BB_DATA_OUT_EN_SDIO1 Value */
#define MXC_S_SPIXFC_GEN_CTRL_BB_DATA_OUT_EN_SDIO1     (MXC_V_SPIXFC_GEN_CTRL_BB_DATA_OUT_EN_SDIO1 << MXC_F_SPIXFC_GEN_CTRL_BB_DATA_OUT_EN_POS) /**< GEN_CTRL_BB_DATA_OUT_EN_SDIO1 Setting */
#define MXC_V_SPIXFC_GEN_CTRL_BB_DATA_OUT_EN_SDIO2     ((uint32_t)0x2UL) /**< GEN_CTRL_BB_DATA_OUT_EN_SDIO2 Value */
#define MXC_S_SPIXFC_GEN_CTRL_BB_DATA_OUT_EN_SDIO2     (MXC_V_SPIXFC_GEN_CTRL_BB_DATA_OUT_EN_SDIO2 << MXC_F_SPIXFC_GEN_CTRL_BB_DATA_OUT_EN_POS) /**< GEN_CTRL_BB_DATA_OUT_EN_SDIO2 Setting */
#define MXC_V_SPIXFC_GEN_CTRL_BB_DATA_OUT_EN_SDIO3     ((uint32_t)0x3UL) /**< GEN_CTRL_BB_DATA_OUT_EN_SDIO3 Value */
#define MXC_S_SPIXFC_GEN_CTRL_BB_DATA_OUT_EN_SDIO3     (MXC_V_SPIXFC_GEN_CTRL_BB_DATA_OUT_EN_SDIO3 << MXC_F_SPIXFC_GEN_CTRL_BB_DATA_OUT_EN_POS) /**< GEN_CTRL_BB_DATA_OUT_EN_SDIO3 Setting */

#define MXC_F_SPIXFC_GEN_CTRL_SIMPLE_POS               20 /**< GEN_CTRL_SIMPLE Position */
#define MXC_F_SPIXFC_GEN_CTRL_SIMPLE                   ((uint32_t)(0x1UL << MXC_F_SPIXFC_GEN_CTRL_SIMPLE_POS)) /**< GEN_CTRL_SIMPLE Mask */

