analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32665/Include/spixfc_regs.h
#define MXC_F_SPIXFC_GEN_CTRL_SIMPLERX_POS             21 /**< GEN_CTRL_SIMPLERX Position */
#define MXC_F_SPIXFC_GEN_CTRL_SIMPLERX                 ((uint32_t)(0x1UL << MXC_F_SPIXFC_GEN_CTRL_SIMPLERX_POS)) /**< GEN_CTRL_SIMPLERX Mask */

#define MXC_F_SPIXFC_GEN_CTRL_SMPLSS_POS               22 /**< GEN_CTRL_SMPLSS Position */
#define MXC_F_SPIXFC_GEN_CTRL_SMPLSS                   ((uint32_t)(0x1UL << MXC_F_SPIXFC_GEN_CTRL_SMPLSS_POS)) /**< GEN_CTRL_SMPLSS Mask */

#define MXC_F_SPIXFC_GEN_CTRL_SCLK_FB_POS              24 /**< GEN_CTRL_SCLK_FB Position */
#define MXC_F_SPIXFC_GEN_CTRL_SCLK_FB                  ((uint32_t)(0x1UL << MXC_F_SPIXFC_GEN_CTRL_SCLK_FB_POS)) /**< GEN_CTRL_SCLK_FB Mask */

#define MXC_F_SPIXFC_GEN_CTRL_SCKFBINV_POS             25 /**< GEN_CTRL_SCKFBINV Position */
#define MXC_F_SPIXFC_GEN_CTRL_SCKFBINV                 ((uint32_t)(0x1UL << MXC_F_SPIXFC_GEN_CTRL_SCKFBINV_POS)) /**< GEN_CTRL_SCKFBINV Mask */

/**@} end of group SPIXFC_GEN_CTRL_Register */

/**
 * @ingroup  spixfc_registers
 * @defgroup SPIXFC_FIFO_CTRL SPIXFC_FIFO_CTRL
 * @brief    SPIX Controller FIFO Control and Status Register.
 * @{
 */
#define MXC_F_SPIXFC_FIFO_CTRL_TX_FIFO_AE_LVL_POS      0 /**< FIFO_CTRL_TX_FIFO_AE_LVL Position */
#define MXC_F_SPIXFC_FIFO_CTRL_TX_FIFO_AE_LVL          ((uint32_t)(0xFUL << MXC_F_SPIXFC_FIFO_CTRL_TX_FIFO_AE_LVL_POS)) /**< FIFO_CTRL_TX_FIFO_AE_LVL Mask */

#define MXC_F_SPIXFC_FIFO_CTRL_TX_FIFO_CNT_POS         8 /**< FIFO_CTRL_TX_FIFO_CNT Position */
#define MXC_F_SPIXFC_FIFO_CTRL_TX_FIFO_CNT             ((uint32_t)(0x1FUL << MXC_F_SPIXFC_FIFO_CTRL_TX_FIFO_CNT_POS)) /**< FIFO_CTRL_TX_FIFO_CNT Mask */

#define MXC_F_SPIXFC_FIFO_CTRL_RX_FIFO_AF_LVL_POS      16 /**< FIFO_CTRL_RX_FIFO_AF_LVL Position */
#define MXC_F_SPIXFC_FIFO_CTRL_RX_FIFO_AF_LVL          ((uint32_t)(0x1FUL << MXC_F_SPIXFC_FIFO_CTRL_RX_FIFO_AF_LVL_POS)) /**< FIFO_CTRL_RX_FIFO_AF_LVL Mask */

#define MXC_F_SPIXFC_FIFO_CTRL_RX_FIFO_CNT_POS         24 /**< FIFO_CTRL_RX_FIFO_CNT Position */
#define MXC_F_SPIXFC_FIFO_CTRL_RX_FIFO_CNT             ((uint32_t)(0x3FUL << MXC_F_SPIXFC_FIFO_CTRL_RX_FIFO_CNT_POS)) /**< FIFO_CTRL_RX_FIFO_CNT Mask */

/**@} end of group SPIXFC_FIFO_CTRL_Register */

/**
 * @ingroup  spixfc_registers
 * @defgroup SPIXFC_SPCTRL SPIXFC_SPCTRL
 * @brief    SPIX Controller Special Control Register.
 * @{
 */
#define MXC_F_SPIXFC_SPCTRL_SAMPL_POS                  0 /**< SPCTRL_SAMPL Position */
#define MXC_F_SPIXFC_SPCTRL_SAMPL                      ((uint32_t)(0x1UL << MXC_F_SPIXFC_SPCTRL_SAMPL_POS)) /**< SPCTRL_SAMPL Mask */

#define MXC_F_SPIXFC_SPCTRL_SDIOOUT_POS                4 /**< SPCTRL_SDIOOUT Position */
#define MXC_F_SPIXFC_SPCTRL_SDIOOUT                    ((uint32_t)(0xFUL << MXC_F_SPIXFC_SPCTRL_SDIOOUT_POS)) /**< SPCTRL_SDIOOUT Mask */
#define MXC_V_SPIXFC_SPCTRL_SDIOOUT_SDIO0              ((uint32_t)0x0UL) /**< SPCTRL_SDIOOUT_SDIO0 Value */
#define MXC_S_SPIXFC_SPCTRL_SDIOOUT_SDIO0              (MXC_V_SPIXFC_SPCTRL_SDIOOUT_SDIO0 << MXC_F_SPIXFC_SPCTRL_SDIOOUT_POS) /**< SPCTRL_SDIOOUT_SDIO0 Setting */
#define MXC_V_SPIXFC_SPCTRL_SDIOOUT_SDIO1              ((uint32_t)0x1UL) /**< SPCTRL_SDIOOUT_SDIO1 Value */
#define MXC_S_SPIXFC_SPCTRL_SDIOOUT_SDIO1              (MXC_V_SPIXFC_SPCTRL_SDIOOUT_SDIO1 << MXC_F_SPIXFC_SPCTRL_SDIOOUT_POS) /**< SPCTRL_SDIOOUT_SDIO1 Setting */
#define MXC_V_SPIXFC_SPCTRL_SDIOOUT_SDIO2              ((uint32_t)0x2UL) /**< SPCTRL_SDIOOUT_SDIO2 Value */
#define MXC_S_SPIXFC_SPCTRL_SDIOOUT_SDIO2              (MXC_V_SPIXFC_SPCTRL_SDIOOUT_SDIO2 << MXC_F_SPIXFC_SPCTRL_SDIOOUT_POS) /**< SPCTRL_SDIOOUT_SDIO2 Setting */
#define MXC_V_SPIXFC_SPCTRL_SDIOOUT_SDIO3              ((uint32_t)0x3UL) /**< SPCTRL_SDIOOUT_SDIO3 Value */
#define MXC_S_SPIXFC_SPCTRL_SDIOOUT_SDIO3              (MXC_V_SPIXFC_SPCTRL_SDIOOUT_SDIO3 << MXC_F_SPIXFC_SPCTRL_SDIOOUT_POS) /**< SPCTRL_SDIOOUT_SDIO3 Setting */

#define MXC_F_SPIXFC_SPCTRL_SDIOOE_POS                 8 /**< SPCTRL_SDIOOE Position */
#define MXC_F_SPIXFC_SPCTRL_SDIOOE                     ((uint32_t)(0xFUL << MXC_F_SPIXFC_SPCTRL_SDIOOE_POS)) /**< SPCTRL_SDIOOE Mask */
#define MXC_V_SPIXFC_SPCTRL_SDIOOE_SDIO0               ((uint32_t)0x0UL) /**< SPCTRL_SDIOOE_SDIO0 Value */
#define MXC_S_SPIXFC_SPCTRL_SDIOOE_SDIO0               (MXC_V_SPIXFC_SPCTRL_SDIOOE_SDIO0 << MXC_F_SPIXFC_SPCTRL_SDIOOE_POS) /**< SPCTRL_SDIOOE_SDIO0 Setting */
#define MXC_V_SPIXFC_SPCTRL_SDIOOE_SDIO1               ((uint32_t)0x1UL) /**< SPCTRL_SDIOOE_SDIO1 Value */
#define MXC_S_SPIXFC_SPCTRL_SDIOOE_SDIO1               (MXC_V_SPIXFC_SPCTRL_SDIOOE_SDIO1 << MXC_F_SPIXFC_SPCTRL_SDIOOE_POS) /**< SPCTRL_SDIOOE_SDIO1 Setting */
#define MXC_V_SPIXFC_SPCTRL_SDIOOE_SDIO2               ((uint32_t)0x2UL) /**< SPCTRL_SDIOOE_SDIO2 Value */
#define MXC_S_SPIXFC_SPCTRL_SDIOOE_SDIO2               (MXC_V_SPIXFC_SPCTRL_SDIOOE_SDIO2 << MXC_F_SPIXFC_SPCTRL_SDIOOE_POS) /**< SPCTRL_SDIOOE_SDIO2 Setting */
#define MXC_V_SPIXFC_SPCTRL_SDIOOE_SDIO3               ((uint32_t)0x3UL) /**< SPCTRL_SDIOOE_SDIO3 Value */
#define MXC_S_SPIXFC_SPCTRL_SDIOOE_SDIO3               (MXC_V_SPIXFC_SPCTRL_SDIOOE_SDIO3 << MXC_F_SPIXFC_SPCTRL_SDIOOE_POS) /**< SPCTRL_SDIOOE_SDIO3 Setting */

#define MXC_F_SPIXFC_SPCTRL_SCLKINH3_POS               16 /**< SPCTRL_SCLKINH3 Position */
#define MXC_F_SPIXFC_SPCTRL_SCLKINH3                   ((uint32_t)(0x1UL << MXC_F_SPIXFC_SPCTRL_SCLKINH3_POS)) /**< SPCTRL_SCLKINH3 Mask */

/**@} end of group SPIXFC_SPCTRL_Register */

/**
 * @ingroup  spixfc_registers
 * @defgroup SPIXFC_INTFL SPIXFC_INTFL
 * @brief    SPIX Controller Interrupt Status Register.
 * @{
 */
#define MXC_F_SPIXFC_INTFL_TX_STALLED_POS              0 /**< INTFL_TX_STALLED Position */
#define MXC_F_SPIXFC_INTFL_TX_STALLED                  ((uint32_t)(0x1UL << MXC_F_SPIXFC_INTFL_TX_STALLED_POS)) /**< INTFL_TX_STALLED Mask */

#define MXC_F_SPIXFC_INTFL_RX_STALLED_POS              1 /**< INTFL_RX_STALLED Position */
#define MXC_F_SPIXFC_INTFL_RX_STALLED                  ((uint32_t)(0x1UL << MXC_F_SPIXFC_INTFL_RX_STALLED_POS)) /**< INTFL_RX_STALLED Mask */

#define MXC_F_SPIXFC_INTFL_TX_READY_POS                2 /**< INTFL_TX_READY Position */
#define MXC_F_SPIXFC_INTFL_TX_READY                    ((uint32_t)(0x1UL << MXC_F_SPIXFC_INTFL_TX_READY_POS)) /**< INTFL_TX_READY Mask */

